app/controllers/merchandisers_controller.rb

SELECT "merchandisers".* FROM "merchandisers"
---
  def index
    merchandisers = Merchandiser.all