app/controllers/orders_controller.rb

    def index
        orders = Order.all
---
SELECT "orders".* FROM "orders" WHERE 1=1

    def show
        order = Order.find_by(id: params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def create
        order =Order.create!(order_params)
---
INSERT INTO "orders" ("customer_name", "products_ordered", "date", "merchandiser_id", "created_at", "updated_at", "location", "sale") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def filter
        duration = params[:duration]

        case duration
        when 'today'
          start_date = Date.today
          end_date = Date.today
        when 'this_week'
          start_date = Date.today.beginning_of_week
          end_date = Date.today.end_of_week
        when 'this_month'
          start_date = Date.today.beginning_of_month
          end_date = Date.today.end_of_month
        when 'this_year'
            start_date = Date.today.beginning_of_year
            end_date = Date.today.end_of_year
        else
            start_date = nil
            end_date = nil
        end

        filtered_orders = Order.where(date: start_date..end_date)
---
SELECT "orders".* FROM "orders" WHERE "orders"."date" BETWEEN $1 AND $2  [["date", "2023-08-07"], ["date", "2023-08-07"]]